In [3]:
%load_ext sql

In [1]:
import json 


with open('db_credentials.json', 'r') as f:
    data = json.load(f)
    NAME, USER, PASS = \
        data['name'], data['username'], data['password']

In [167]:
%sql postgresql://$USER:$PASS@localhost/pagila

In [72]:
%sql DROP TABLE IF EXISTS dim_date;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [73]:
%%sql 
CREATE TABLE IF NOT EXISTS dim_date (
    date_key SERIAL PRIMARY KEY,
    date TIMESTAMP,
    year INT,
    quarter INT,
    month INT,
    day INT,
    week INT,
    is_weekend BOOL
);

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [74]:
%sql SELECT * FROM dim_date

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
0 rows affected.

[]

In [77]:
%%sql 

INSERT INTO dim_date
(date, year, quarter, month, day, week, is_weekend)
SELECT
payment_date as date,
EXTRACT(YEAR FROM payment_date) as year,
EXTRACT(QUARTER FROM payment_date) as quarter,
EXTRACT(MONTH FROM payment_date) as month,
EXTRACT(DAY FROM payment_date) as day,
EXTRACT(WEEK FROM payment_date) as week,
CASE 
WHEN EXTRACT(DOW FROM payment_date) IN (6, 7) THEN TRUE
ELSE FALSE
END as is_weekend
FROM payment

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
16049 rows affected.

[]

In [78]:
%sql SELECT * FROM dim_date LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, datetime.datetime(2020, 1, 24, 21, 40, 19, 996577), 2020, 1, 1, 24, 4, False),
 (2, datetime.datetime(2020, 1, 25, 15, 16, 50, 996577), 2020, 1, 1, 25, 4, True),
 (3, datetime.datetime(2020, 1, 28, 21, 44, 14, 996577), 2020, 1, 1, 28, 5, False),
 (4, datetime.datetime(2020, 1, 29, 0, 58, 2, 996577), 2020, 1, 1, 29, 5, False),
 (5, datetime.datetime(2020, 1, 29, 8, 10, 6, 996577), 2020, 1, 1, 29, 5, False)]

In [89]:
%sql DROP TABLE IF EXISTS dim_customer

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [91]:
%%sql
CREATE TABLE IF NOT EXISTS dim_customer (
    customer_key SERIAL PRIMARY KEY,
    customer_id INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(128),
    address VARCHAR(512),
    address2 VARCHAR(512),
    district VARCHAR(50),
    city VARCHAR(50),
    country VARCHAR(50),
    postal_code VARCHAR(50),
    phone VARCHAR(50),
    active INT,
    create_date TIMESTAMP
)

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [92]:
%sql SELECT * FROM dim_customer

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
0 rows affected.

[]

In [83]:
%sql SELECT * FROM customer LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1),
 (2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1),
 (3, 1, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', 7, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1),
 (4, 2, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', 8, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1),
 (5, 1, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', 9, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1)]

In [104]:
%%sql
INSERT INTO dim_customer 
(customer_id, first_name, last_name, email, address, address2,
district, city, country, postal_code, phone, active, create_date)
SELECT 
    c.customer_id, c.first_name, c.last_name, c.email, a.address,
    a.address2, a.district, ci.city, co.country, a.postal_code,
    a.phone,
    CASE c.activebool
    WHEN TRUE THEN 1
    ELSE 0
    END,
    c.create_date

FROM (((customer c
JOIN address a
ON c.address_id = a.address_id)
JOIN city ci
ON a.city_id = ci.city_id)
JOIN country co
ON ci.country_id = co.country_id)

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
599 rows affected.

[]

In [84]:
%sql SELECT * FROM address LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', datetime.datetime(2020, 2, 15, 9, 45, 30, tzinfo=datetime.timezone.utc)),
 (2, '28 MySQL Boulevard', None, 'QLD', 576, '', '', datetime.datetime(2020, 2, 15, 9, 45, 30, tzinfo=datetime.timezone.utc)),
 (3, '23 Workhaven Lane', None, 'Alberta', 300, '', '14033335568', datetime.datetime(2020, 2, 15, 9, 45, 30, tzinfo=datetime.timezone.utc)),
 (4, '1411 Lillydale Drive', None, 'QLD', 576, '', '6172235589', datetime.datetime(2020, 2, 15, 9, 45, 30, tzinfo=datetime.timezone.utc)),
 (5, '1913 Hanoi Way', '', 'Nagasaki', 463, '35200', '28303384290', datetime.datetime(2020, 2, 15, 9, 45, 30, tzinfo=datetime.timezone.utc))]

In [85]:
%sql SELECT * FROM city LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, 'A Corua (La Corua)', 87, datetime.datetime(2020, 2, 15, 9, 45, 25, tzinfo=datetime.timezone.utc)),
 (2, 'Abha', 82, datetime.datetime(2020, 2, 15, 9, 45, 25, tzinfo=datetime.timezone.utc)),
 (3, 'Abu Dhabi', 101, datetime.datetime(2020, 2, 15, 9, 45, 25, tzinfo=datetime.timezone.utc)),
 (4, 'Acua', 60, datetime.datetime(2020, 2, 15, 9, 45, 25, tzinfo=datetime.timezone.utc)),
 (5, 'Adana', 97, datetime.datetime(2020, 2, 15, 9, 45, 25, tzinfo=datetime.timezone.utc))]

In [86]:
%sql SELECT * FROM country LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, 'Afghanistan', datetime.datetime(2020, 2, 15, 9, 44, tzinfo=datetime.timezone.utc)),
 (2, 'Algeria', datetime.datetime(2020, 2, 15, 9, 44, tzinfo=datetime.timezone.utc)),
 (3, 'American Samoa', datetime.datetime(2020, 2, 15, 9, 44, tzinfo=datetime.timezone.utc)),
 (4, 'Angola', datetime.datetime(2020, 2, 15, 9, 44, tzinfo=datetime.timezone.utc)),
 (5, 'Anguilla', datetime.datetime(2020, 2, 15, 9, 44, tzinfo=datetime.timezone.utc))]

In [88]:
%%sql 
SELECT * FROM payment
JOIN customer 
ON payment.customer_id = customer.customer_id 
LIMIT 5

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(16677, 1, 1, 76, Decimal('2.99'), datetime.datetime(2020, 1, 25, 9, 59, 3, 996577, tzinfo=datetime.timezone.utc), 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1),
 (16678, 1, 1, 573, Decimal('0.99'), datetime.datetime(2020, 1, 28, 9, 3, 49, 996577, tzinfo=datetime.timezone.utc), 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1),
 (18495, 1, 1, 1185, Decimal('5.99'), datetime.datetime(2020, 2, 14, 23, 22, 38, 996577, tzinfo=datetime.timezone.utc), 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1),
 (18496, 1, 2, 1422, Decimal('0.99'), datetime.datetime(2020, 2, 15, 16, 31, 19, 996577, tzinfo=datetime.timezone.utc), 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1),
 (18497, 1, 2, 1476, Decimal('9.99'), datetime.datetime(2020, 2, 15, 19, 37, 12, 996577, tzinfo=datetime.timezone.utc), 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2020, 2, 14), datetime.datetime(2020, 2, 15, 9, 57, 20, tzinfo=datetime.timezone.utc), 1)]

In [103]:
%%sql 
SELECT 
c.customer_id, c.first_name, c.last_name, c.email, a.address,
    a.address2, a.district, ci.city, co.country, a.postal_code,
    a.phone,
    CASE c.activebool
    WHEN TRUE THEN 1
    ELSE 0
    END as active,
    c.create_date

FROM (((customer c
JOIN address a
ON c.address_id = a.address_id)
JOIN city ci
ON a.city_id = ci.city_id)
JOIN country co
ON ci.country_id = co.country_id)
WHERE address2 != 'salam'
LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.date(2020, 2, 14)),
 (2, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.date(2020, 2, 14)),
 (3, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.date(2020, 2, 14)),
 (4, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.date(2020, 2, 14)),
 (5, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.date(2020, 2, 14))]

In [102]:
%sql SELECT DISTINCT address2 FROM address LIMIT 5

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
2 rows affected.

[('',), (None,)]

In [105]:
%sql SELECT * FROM dim_customer LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2020, 2, 14, 0, 0)),
 (2, 2, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.datetime(2020, 2, 14, 0, 0)),
 (3, 3, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.datetime(2020, 2, 14, 0, 0)),
 (4, 4, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.datetime(2020, 2, 14, 0, 0)),
 (5, 5, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.datetime(2020, 2, 14, 0, 0))]

In [106]:
%sql SELECT * FROM store

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
2 rows affected.

[(1, 1, 1, datetime.datetime(2020, 2, 15, 9, 57, 12, tzinfo=datetime.timezone.utc)),
 (2, 2, 2, datetime.datetime(2020, 2, 15, 9, 57, 12, tzinfo=datetime.timezone.utc))]

In [107]:
%sql DROP TABLE IF EXISTS dim_store

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [108]:
%%sql
CREATE TABLE IF NOT EXISTS dim_store (
    store_key SERIAL PRIMARY KEY,
    store_id INT,
    address VARCHAR(512),
    address2 VARCHAR(512),
    district VARCHAR(50),
    city VARCHAR(50),
    country VARCHAR(50),
    postal_code VARCHAR(50),
    manager_first_name VARCHAR(50),
    manager_last_name VARCHAR(50),
    last_update TIMESTAMP
)

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [119]:
%%sql 
INSERT INTO dim_store
(store_id, address, address2, district, city, country, postal_code,
manager_first_name, manager_last_name, last_update)
SELECT
s.store_id, a.address, a.address2, a.district, ci.city, co.country,
a.postal_code, st.first_name, st.last_name, s.last_update
FROM (((store s 
JOIN address a 
ON s.address_id = a.address_id) 
JOIN staff st
ON st.staff_id = s.manager_staff_id)
JOIN city ci 
ON a.city_id = ci.city_id)
JOIN country co
ON co.country_id = ci.country_id

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
2 rows affected.

[]

In [120]:
%sql SELECT * FROM dim_store

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
2 rows affected.

[(1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.datetime(2020, 2, 15, 9, 57, 12)),
 (2, 2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.datetime(2020, 2, 15, 9, 57, 12))]

In [116]:
%%sql 
SELECT

FROM ((store s 
JOIN address a 
ON s.address_id = a.address_id) 
JOIN staff st
ON st.staff_id = s.manager_staff_id)
LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
2 rows affected.

[('Mike', 'Hillyer'), ('Jon', 'Stephens')]

In [112]:
%sql DROP TABLE IF EXISTS staff_new

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [ ]:
%%sql CREATE TABLE IF NOT EXISTS staff_new (
    staff_id
)

In [115]:
%sql SELECT staff_id, first_name, last_name FROM staff

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
2 rows affected.

[(1, 'Mike', 'Hillyer'), (2, 'Jon', 'Stephens')]

In [121]:
%sql SELECT * FROM dim_store

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
2 rows affected.

[(1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.datetime(2020, 2, 15, 9, 57, 12)),
 (2, 2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.datetime(2020, 2, 15, 9, 57, 12))]

In [145]:
%sql DROP TABLE IF EXISTS dim_movie

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [146]:
%%sql
CREATE TABLE IF NOT EXISTS dim_movie (
    movie_key SERIAL PRIMARY KEY,
    film_id INT,
    title VARCHAR(128),
    description VARCHAR(1024),
    release_year INT,
    language VARCHAR(50),
    rental_duration INT,
    length INT,
    rating VARCHAR(50),
    special_features VARCHAR(1024)
)

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [147]:
%%sql 
INSERT INTO dim_movie
(film_id, title, description, release_year, language, rental_duration, length, rating, special_features)
SELECT 
f.film_id, f.title, f.description, f.release_year, l.name,
f.rental_duration, f.length, f.rating, f.special_features
FROM film f
JOIN language l 
ON f.language_id = l.language_id

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
1000 rows affected.

[]

In [148]:
%sql SELECT * FROM dim_movie LIMIT 5

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, 1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 'English', 6, 86, 'PG', '{"Deleted Scenes","Behind the Scenes"}'),
 (2, 2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 'English', 3, 48, 'G', '{Trailers,"Deleted Scenes"}'),
 (3, 3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 'English', 7, 50, 'NC-17', '{Trailers,"Deleted Scenes"}'),
 (4, 4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 'English', 5, 117, 'G', '{Commentaries,"Behind the Scenes"}'),
 (5, 5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 'English', 6, 130, 'G', '{"Deleted Scenes"}')]

In [137]:
%%sql 
SELECT * FROM (film f
JOIN language l1
ON f.original_language_id = l1.language_id)
JOIN language l2
ON f.language_id = l2.language_id
LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
0 rows affected.

[]

In [139]:
%sql SELECT * FROM language

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
6 rows affected.

[(1, 'English             ', datetime.datetime(2020, 2, 15, 10, 2, 19, tzinfo=datetime.timezone.utc)),
 (2, 'Italian             ', datetime.datetime(2020, 2, 15, 10, 2, 19, tzinfo=datetime.timezone.utc)),
 (3, 'Japanese            ', datetime.datetime(2020, 2, 15, 10, 2, 19, tzinfo=datetime.timezone.utc)),
 (4, 'Mandarin            ', datetime.datetime(2020, 2, 15, 10, 2, 19, tzinfo=datetime.timezone.utc)),
 (5, 'French              ', datetime.datetime(2020, 2, 15, 10, 2, 19, tzinfo=datetime.timezone.utc)),
 (6, 'German              ', datetime.datetime(2020, 2, 15, 10, 2, 19, tzinfo=datetime.timezone.utc))]

In [149]:
%sql DROP TABLE IF EXISTS fact_sales

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [150]:
%%sql CREATE TABLE IF NOT EXISTS fact_sales (
    sales_key SERIAL PRIMARY KEY,
    date_key INT REFERENCES dim_date(date_key),
    customer_key INT REFERENCES dim_customer(customer_key),
    movie_key INT REFERENCES dim_movie(movie_key),
    store_key INT REFERENCES dim_store(store_key),
    sales_amount INT NOT NULL
)

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
Done.

[]

In [151]:
%sql SELECT * FROM payment LIMIT 5;

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2020, 1, 24, 21, 40, 19, 996577, tzinfo=datetime.timezone.utc)),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2020, 1, 25, 15, 16, 50, 996577, tzinfo=datetime.timezone.utc)),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2020, 1, 28, 21, 44, 14, 996577, tzinfo=datetime.timezone.utc)),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2020, 1, 29, 0, 58, 2, 996577, tzinfo=datetime.timezone.utc)),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2020, 1, 29, 8, 10, 6, 996577, tzinfo=datetime.timezone.utc))]

In [164]:
%%sql 
INSERT INTO fact_sales
(date_key, customer_key, movie_key, store_key, sales_amount)
SELECT 
d.date_key,
c.customer_key,
m.movie_key,
s.store_key,
p.amount
FROM payment p
JOIN dim_date d 
ON d.date = p.payment_date
JOIN rental r
ON r.rental_id = p.rental_id
JOIN inventory i 
ON i.inventory_id = r.inventory_id 
JOIN film f 
ON f.film_id = i.film_id
JOIN dim_movie m
ON m.film_id = i.film_id
JOIN dim_customer c 
ON c.customer_id = p.customer_id 
JOIN dim_store s 
ON s.store_id = i.store_id

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
49093 rows affected.

[]

In [160]:
%%sql SELECT * FROM rental 
JOIN inventory 
ON inventory.inventory_id = rental.inventory_id
JOIN film
ON film.film_id = inventory.film_id
LIMIT 2

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
2 rows affected.

[(2, datetime.datetime(2005, 5, 24, 21, 54, 33, tzinfo=datetime.timezone.utc), 1525, 459, datetime.datetime(2005, 5, 28, 18, 40, 33, tzinfo=datetime.timezone.utc), 1, datetime.datetime(2020, 2, 16, 2, 30, 53, tzinfo=datetime.timezone.utc), 1525, 333, 2, datetime.datetime(2020, 2, 15, 10, 9, 17, tzinfo=datetime.timezone.utc), 333, 'FREAKY POCUS', 'A Fast-Paced Documentary of a Pastry Chef And a Crocodile who must Chase a Squirrel in The Gulf of Mexico', 2006, 1, None, 7, Decimal('2.99'), 126, Decimal('16.99'), 'R', datetime.datetime(2020, 9, 10, 16, 46, 3, 905795, tzinfo=datetime.timezone.utc), ['Trailers', 'Behind the Scenes'], "'chase':17 'chef':11 'crocodil':14 'documentari':7 'fast':5 'fast-pac':4 'freaki':1 'gulf':22 'mexico':24 'must':16 'pace':6 'pastri':10 'pocus':2 'squirrel':19"),
 (3, datetime.datetime(2005, 5, 24, 22, 3, 39, tzinfo=datetime.timezone.utc), 1711, 408, datetime.datetime(2005, 6, 1, 21, 12, 39, tzinfo=datetime.timezone.utc), 1, datetime.datetime(2020, 2, 16, 2, 30, 53, tzinfo=datetime.timezone.utc), 1711, 373, 2, datetime.datetime(2020, 2, 15, 10, 9, 17, tzinfo=datetime.timezone.utc), 373, 'GRADUATE LORD', 'A Lacklusture Epistle of a Girl And a A Shark who must Meet a Mad Scientist in Ancient China', 2006, 1, None, 7, Decimal('2.99'), 156, Decimal('14.99'), 'G', datetime.datetime(2020, 9, 10, 16, 46, 3, 905795, tzinfo=datetime.timezone.utc), ['Trailers', 'Behind the Scenes'], "'ancient':20 'china':21 'epistl':5 'girl':8 'graduat':1 'lacklustur':4 'lord':2 'mad':17 'meet':15 'must':14 'scientist':18 'shark':12")]

In [163]:
%sql SELECT * FROM inventory LIMIT 5

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2020, 2, 15, 10, 9, 17, tzinfo=datetime.timezone.utc)),
 (2, 1, 1, datetime.datetime(2020, 2, 15, 10, 9, 17, tzinfo=datetime.timezone.utc)),
 (3, 1, 1, datetime.datetime(2020, 2, 15, 10, 9, 17, tzinfo=datetime.timezone.utc)),
 (4, 1, 1, datetime.datetime(2020, 2, 15, 10, 9, 17, tzinfo=datetime.timezone.utc)),
 (5, 1, 2, datetime.datetime(2020, 2, 15, 10, 9, 17, tzinfo=datetime.timezone.utc))]

In [165]:
%sql SELECT * FROM fact_sales LIMIT 5

   postgresql://pazzo:***@localhost/dvdrental
 * postgresql://pazzo:***@localhost/pagila
5 rows affected.

[(1, 891, 130, 81, 1, 3),
 (2, 357, 459, 333, 2, 3),
 (3, 266, 408, 373, 2, 4),
 (4, 136, 333, 535, 1, 5),
 (5, 1048, 222, 450, 2, 7)]